{
  "schema":{
    "fields":[
      {
        "name":"dataset",
        "type":"string"
      },
      {
        "name":"subject",
        "type":"string"
      },
      {
        "name":"body_count",
        "type":"integer"
      },
      {
        "name":"body_choice",
        "type":"string"
      },
      {
        "name":"toxic_sum",
        "type":"integer"
      },
      {
        "name":"severe_toxic_sum",
        "type":"integer"
      },
      {
        "name":"obscene_sum",
        "type":"integer"
      },
      {
        "name":"threat_sum",
        "type":"integer"
      },
      {
        "name":"insult_sum",
        "type":"integer"
      },
      {
        "name":"identity_hate_sum",
        "type":"integer"
      },
      {
        "name":"positive_sum",
        "type":"integer"
      },
      {
        "name":"negative_sum",
        "type":"integer"
      },
      {
        "name":"neutral_sum",
        "type":"integer"
      }
    ],
    "primaryKey":[
      "dataset",
      "subject"
    ],
    "pandas_version":"0.20.0"
  },
  "data":[
    {
      "dataset":"Reddit",
      "subject":"alt.atheism",
      "body_count":94,
      "body_choice":"I am Brazilian...",
      "toxic_sum":2,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":9,
      "negative_sum":9,
      "neutral_sum":76
    },
    {
      "dataset":"Reddit",
      "subject":"comp.graphics",
      "body_count":18,
      "body_choice":"r\/ItHadToBeBrazil",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":2,
      "negative_sum":0,
      "neutral_sum":16
    },
    {
      "dataset":"Reddit",
      "subject":"comp.os.ms-windows.misc",
      "body_count":14,
      "body_choice":"Look bro, I don't care what you torrent or not torrent.\n\nBut most of the money goes to the studios and not the actors\/directors\/writers\/musicians..... \n\nBesides I already pay for hbo\/hbogo\/hbood is it really wrong to download the torrent so I can watch it on my computer? And since you can't play a 4k bluray on Linux using opensource sw I don't have a choice. If you could pay 1 eur for a drm free mkv of your favorite show in the best quality available the same time it airs and download it at max speed I and many others would do that. But I'm not paying 10 times for the same thing that's full of drm garbage.\n\nAlso downloading is legal here, upload is a civil matter and the methods used to catch people are illegal and any evidence obtained using them or derived from it inadmissible. So they can sue me, but they'd have to admit to breaking the law first. They'd lose the lawsuit since there would be no admissible evidence and they would be prosecuted for breaking the law. So.\n\nAlso I once bought a movie on itunes when it was released to support the actors\/creators\/... And it didn't play on anything but itunes which is a pile of trash, the subtitles were wrong half the time and it was in 720p despite being sold as 1080p. They fixed the resolution and subs. But it still doesn't play on anything but itunes. So I grabbed the torrent which had great subtitles, was in 1080p and the file could be played on anything fast enough to decode it. \n\nSaid movie has a tv show too. I bought the dvds but still torrented it because I found the torrents (took a month to download since the only seed was in Brazil and had very bad ul in almost hd (900p) and they never released in anything higher than dvd quality. And because it's just more convenient having it on your hard drive than on dvds. I don't even have enough sata ports to plug in a dvd player (board has 6, ssd + 5 hdds = 6 too).\n\nI bought a few games on gog to since there's no drm (bg1 and 2 ee) + they work on Linux\n\nI bought lotr extened edition too but I'm not going to pay for the blurays too since it the same movie at a higher resolution. If I bought the right to play said movie then I also bought the right to play it in a higher resolution. And besides since you can play 4k blurays on Linux with opensource sw.... and when you'll be able to do that, I'll be considered illegal because apparently you can play movies you bought on an operating system you want using the sw you want. Fuck that.",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":0,
      "negative_sum":4,
      "neutral_sum":10
    },
    {
      "dataset":"Reddit",
      "subject":"comp.sys.ibm.pc.hardware",
      "body_count":5,
      "body_choice":"Coltan is the main ore currently. It's needed in like Lithium ion batteries. It's mostly mined as a conflict mineral in the DRC, Rwanda, Brazil, China, and Nigeria.",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":0,
      "negative_sum":0,
      "neutral_sum":5
    },
    {
      "dataset":"Reddit",
      "subject":"comp.sys.mac.hardware",
      "body_count":11,
      "body_choice":"Mods, this post is Portuguese from Brazil, annoucing a duo competition.\n\nAlthough you need to pay 20 reais (local coin) to participate, making it an illegal tournament due to self profit (I think)\n",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":3,
      "negative_sum":0,
      "neutral_sum":8
    },
    {
      "dataset":"Reddit",
      "subject":"comp.windows.x",
      "body_count":8,
      "body_choice":"Hi there! Your post was removed because it uses the body text box. You can only use the title field to post a question in askreddit.  Per [rule 1](\/r\/AskReddit\/wiki\/index#wiki_-rule_1-), use of the body text box is prohibited. You can resubmit your post [here](&lt;\/r\/askreddit\/submit?selftext=true&amp;title=What are some flirty things Portuguese phrases to send to a Brazilian woman.&gt;) without the textbox.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/AskReddit) if you have any questions or concerns.*",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":0,
      "negative_sum":0,
      "neutral_sum":8
    },
    {
      "dataset":"Reddit",
      "subject":"misc.forsale",
      "body_count":37,
      "body_choice":"I really think this is the reason Brazil never attempted to make Paraná and Uruguay rivers navigable for cargo, in spite of how cheap this would be compared to building rail or roads, this would simply make cities like Chapecó and Uruguaiana integrate better in the platina economy\/trade to the detriment of hubs like São Paulo\/Santos.\n\nNow there are all those huge dams and not a single lock in them.",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":7,
      "negative_sum":1,
      "neutral_sum":29
    },
    {
      "dataset":"Reddit",
      "subject":"rec.autos",
      "body_count":74,
      "body_choice":"Did you read the article you linked?\n\n1. Zero mention of the \"Bernie Bro\" smear.\n\n2. That article points out multiple times that not only did other candidates have the same opportunities Clinton did, all fundraising was geared towards the general, not the primaries.\n\nHere:\n\n&gt;In a letter to DNC members, Chairman Tom Perez noted that the party reached joint fundraising agreements with both Clinton and Vermont Sen. Bernie Sanders. \"The joint fundraising agreements were the same for each campaign except for the treasurer, and our understanding was that the DNC offered all of the presidential campaigns the opportunity to set up a [joint fundraising agreement] and work with the DNC to coordinate on how those funds were used to best prepare for the general election.\"\n\nHere:\n\n&gt;A Democratic official who has reviewed the document pointed out that in addition to the Clinton signoffs Brazile characterized, it included language stating that \"nothing in this agreement shall be construed to violate the DNC's obligation of impartiality and neutrality through the Nominating process\" and that \"all activities performed under this agreement will be focused exclusively on preparations for the General Election and not the Democratic Primary.\"\n\n&gt;The agreement also noted that the DNC \"may enter into similar agreements with other candidates.\" (Read the full memo below.)\n\nHere:\n\n&gt;Clinton campaign manager Robby Mook appeared on CNN Friday night and called \"laughable\" assertions that the agreement rigged the primary against Sanders. Among other things, he pointed to the fact that the memo states that joint efforts were to be focused on the general election.\n\n&gt;\"The DNC came to our campaign and said, 'We need help. We're not prepared for the general election,'\" Mook said. Regarding the fact that the memo gave the Clinton campaign a role in communications hiring, Mook added, \"The purpose of the DNC while a primary is going on is to hold Republican candidates accountable, and nobody was filling that post.\" He also insisted that the Sanders campaign had the ability to enter into a similar arrangement with the party.\n\n\nThe Sanders campaign's sole claim is that they didn't like the debate schedule. Cool.",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":14,
      "negative_sum":17,
      "neutral_sum":43
    },
    {
      "dataset":"Reddit",
      "subject":"rec.motorcycles",
      "body_count":57,
      "body_choice":"I think this is a special Brazilian hookah.. Its a Zeus Hookah! It's my favorite hookah",
      "toxic_sum":5,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":9,
      "negative_sum":12,
      "neutral_sum":36
    },
    {
      "dataset":"Reddit",
      "subject":"rec.sport.baseball",
      "body_count":62,
      "body_choice":"Jair Bolsonaro ordered celebrations to be held on March 31, the day of the coup that started a 21 year long military dictatorship that killed, imprisoned and mostly tortured Brazilians from 1964 to 1985.\n\nThe president is known for praising the regime and claiming it was a necessary and heroic act to save Brazil from a (non existant) communist threat. He is on record saying he is in favor of torture.",
      "toxic_sum":2,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":11,
      "negative_sum":11,
      "neutral_sum":40
    },
    {
      "dataset":"Reddit",
      "subject":"rec.sport.hockey",
      "body_count":96,
      "body_choice":"Always Brazil but France has been the best. Italy, England, Belgium, and Netherlands after that imo. Spain is always with quality so there's that too.\n\nEdit: Argentina and Germany are missing from the usuals but always temporary with them. ",
      "toxic_sum":2,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":24,
      "negative_sum":18,
      "neutral_sum":54
    },
    {
      "dataset":"Reddit",
      "subject":"sci.crypt",
      "body_count":12,
      "body_choice":"Fair enough! Can’t go wrong with Brazil’s attack regardless ",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":2,
      "negative_sum":3,
      "neutral_sum":7
    },
    {
      "dataset":"Reddit",
      "subject":"sci.electronics",
      "body_count":44,
      "body_choice":"across the street is Miranda Bread, which is also a cool Brazilian spot",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":7,
      "negative_sum":7,
      "neutral_sum":30
    },
    {
      "dataset":"Reddit",
      "subject":"sci.med",
      "body_count":87,
      "body_choice":"this is halal meat. if they are buying in bulk from brazil, i would think that there is something about Brazil that made her different. ",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":21,
      "negative_sum":12,
      "neutral_sum":54
    },
    {
      "dataset":"Reddit",
      "subject":"sci.space",
      "body_count":94,
      "body_choice":"It's copypasta but there's one nugget of truth in there that at least in my experiences, most gamers don't give two shits about being PC.   \n\nThese *are* people who will casually drop the n bomb and go on about how shitty Brazilians are in online games, call the Chinese scamming\/hackers and demand games be region locked to keep out the \"undesirables.\".  \n\nI feel like gaming would be a hard media to change as easily as the SJWs would like. It's an area that mostly populated by competitive men and the kinds of people that browse 4chan.",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":19,
      "negative_sum":8,
      "neutral_sum":67
    },
    {
      "dataset":"Reddit",
      "subject":"soc.religion.christian",
      "body_count":41,
      "body_choice":"Yes, but we also make fun of it here. I mean, changing the -o for the -x in words like \"menino\", \"aluno\", etc.\n\nIn Brazil we usually don't use the word \"Latino\" to define ourselves.",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":10,
      "negative_sum":14,
      "neutral_sum":17
    },
    {
      "dataset":"Reddit",
      "subject":"talk.politics.guns",
      "body_count":35,
      "body_choice":"The military dictatorship in Brazil started on April fools. I wasn't alive to not believe it, but it makes me chuckle",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":4,
      "negative_sum":9,
      "neutral_sum":22
    },
    {
      "dataset":"Reddit",
      "subject":"talk.politics.mideast",
      "body_count":64,
      "body_choice":"&gt;Sanders was undermined by the DCCC, it was confirmed by multiple sources including Debbie Wasserman Schultz declassified e-mails, and by Donna Brazil.   \n\nEverything they confirmed happened after he was already mathematically eliminated from winning the majority of pledged delegates.  That's not rigging the vote.  That's moving on to the next stage of the election.",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":11,
      "negative_sum":15,
      "neutral_sum":38
    },
    {
      "dataset":"Reddit",
      "subject":"talk.politics.misc",
      "body_count":89,
      "body_choice":"Agreed that this has nothing to do with the tax exempt status per se, but rather points to a picture of mounting pressure and potential law suits associated with what was clear discrimination.  My point was simply that this law suit could have been conflated with the Bob Jones law suits to create some confusion and the said rumor.  I agree with your analysis that Brazil was a major factor, though some have concluded that SWK actually started building the temple to create this crisis in order to change the policy\/doctrine.  There is evidence that he worked with the Q12 individually over a 2-3 year period to try to get them all on board prior to making the change.  He was evidently very well informed regarding the schisms and tension following the 1890 manifesto and worked hard to avoid a similar situation.  There was also some indication that there was an insider in the carter administration indicated to SWK that they really hated the priesthood ban.",
      "toxic_sum":3,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":12,
      "negative_sum":22,
      "neutral_sum":55
    },
    {
      "dataset":"Reddit",
      "subject":"talk.religion.misc",
      "body_count":7,
      "body_choice":"How can I do to learn more? I dknt know how to dm! Im portuguese speaker from Brazil",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":1,
      "negative_sum":0,
      "neutral_sum":6
    },
    {
      "dataset":"Telegram",
      "subject":"alt.atheism",
      "body_count":227,
      "body_choice":"Brazilian Neo-Integralists Militias are raiding Brazilian Antifascist Resistance \n\n#EleNao #NotHim #BolsonaroMustGo",
      "toxic_sum":5,
      "severe_toxic_sum":0,
      "obscene_sum":5,
      "threat_sum":0,
      "insult_sum":2,
      "identity_hate_sum":0,
      "positive_sum":17,
      "negative_sum":19,
      "neutral_sum":191
    },
    {
      "dataset":"Telegram",
      "subject":"comp.graphics",
      "body_count":78,
      "body_choice":"I found it on the Brazil site",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":3,
      "negative_sum":4,
      "neutral_sum":71
    },
    {
      "dataset":"Telegram",
      "subject":"comp.os.ms-windows.misc",
      "body_count":31,
      "body_choice":"Brazil can not change in 6 months! It will take at least 6 years for change just cos of gangs",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":2,
      "negative_sum":0,
      "neutral_sum":29
    },
    {
      "dataset":"Telegram",
      "subject":"comp.sys.ibm.pc.hardware",
      "body_count":32,
      "body_choice":"Enquanto o povo dormia\nhttp:\/\/averdadesufocada.com\/index.php?option=com_content&view=article&id=15343:enquanto-o-povo-dormia&catid=53&Itemid=102\n\n\n Dinheiro, tecnologia e poder\n\n Marcelo S. Tognozzi - Correio Braziliense \n\n  A Operação Lava-Jato foi além do desmanche do maior esquema de corrupção já desvendado no Brasil. Fez ruir um projeto continental de poder que uniu o PT, a Odebrecht e outras empreiteiras no financiamento de campanhas políticas de esquerda e investimentos bilionários em Cuba. Fui testemunha do nascimento deste projeto em 1994, como enviado especial do Correio Braziliense ao Uruguai e Argentina para apurar as conexões do PT com a esquerda latino-americana para a criação de uma multinacional da política no continente com o nome fantasia de Foro de São Paulo. A entidade foi viabilizada pelo ex-secretário de Relações Internacionais do PT, Marco Aurélio Garcia, morto em 20 de julho, embora a fama pelo empreendimento tenha ficado com Lula\n\n  \n\n A meta do Foro, criado em junho de 1990, era combater o neoliberalismo e criar uma hegemonia partidária e ideológica na América Latina, elegendo parlamentares e governantes. Chamava a atenção, durante a apuração da reportagem, o profissionalismo com que o projeto era conduzido. A comunicação exibia unidade de linguagem, com deputados e dirigentes sindicais de vários países afinados no mesmo discurso. Conforme o projeto avançava e governos iam sendo conquistados, como aconteceu no Brasil em 2002 com a eleição de Lula, surgia explosiva a mistura de ideologia, corrupção com a *compra dos adversários* — como ficou evidente no mensalão e depois na Lava-Jato — e enriquecimento pessoal.\n\n  \n\n Hoje ficou comprovado que a Odebrecht funcionou como braço financeiro do PT para viabilizar um projeto de poder com a eleição de políticos ligados ao Foro de São Paulo. Em troca, a empreiteira reinaria absoluta, como acabou acontecendo em vários países. Ao desbaratar o esquema de corrupção controlado pelo PT, a Lava-Jato lançou luz sobre o avanço do Foro de São Paulo no continente e o papel de arrecadadora e distribuidora de dinheiro da Odebrecht, oferecendo aos parceiros do partido marketing político de primeira linha — inicialmente com Duda Mendonça e depois com João Santana —, plano de governo com obras caras e assessoria para o financiamento dessas obras, muitas das quais receberam recursos do BNDES.\n\n Em junho de 1994, recebi um telefonema do advogado paulista José Carlos Graça Wagner, que me deu detalhes sobre o Foro de São Paulo. Ele jurava que o Foro, criado pelo PT, tinha a finalidade de integrar a esquerda latino-americana e financiar a eleição de Lula e outros líderes latino-americanos e até africanos. Investiguei o assunto e confirmei a história. Marcamos uma conversa no escritório de Graça Wagner, em São Paulo, na Alameda Canuri, 72, Indianápolis\n\n .\n\n Anticomunista ferrenho, beirando os 70 anos, elegante, inteligente e culto, Graça Wagner sabia tudo sobre o Foro de São Paulo: “Eles não querem vencer só no Brasil, querem o poder em toda a América Latina. Pretendem financiar esse projeto com *dinheiro público*”. Deu nomes, datas e uma informação surpreendente para aquela época: dirigentes do Foro em outros países estavam conectados com o PT de São Paulo por uma rede internacional de computadores.\n\n  \n\n Fui para o Uruguai e consegui confirmar a história de José Carlos Graça Wagner. Cheguei até o deputado Jose Bayard, da Vertente Artiguista da Frente Ampla. No seu gabinete no Congresso, *havia um computador ligado em rede com São Paulo, pelo qual se comunicava com a direção nacional do PT em tempo real. “Vamos ampliar isso”, garantiu o deputado. Fiquei impressionado. Numa época em que os celulares eram uma novidade caríssima e a internet engatinhava, uma rede privada internacional de computadores era algo no mínimo ousado*.\n\n  ",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":0,
      "negative_sum":2,
      "neutral_sum":30
    },
    {
      "dataset":"Telegram",
      "subject":"comp.sys.mac.hardware",
      "body_count":24,
      "body_choice":"TheVerge\nBrazilian artist makes history feel like the present with beautiful colorized photos",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":2,
      "negative_sum":2,
      "neutral_sum":20
    },
    {
      "dataset":"Telegram",
      "subject":"comp.windows.x",
      "body_count":43,
      "body_choice":"Trilobites: An Icy Superhighway Once Carried Glaciers From Namibia to Brazil\n\n➖ @nytimes ➖",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":0,
      "negative_sum":0,
      "neutral_sum":43
    },
    {
      "dataset":"Telegram",
      "subject":"misc.forsale",
      "body_count":121,
      "body_choice":"HackerNews\n Bitmovin (YC S15) Hires a Video Solutions Architect \/ Software Engineer in Brazil",
      "toxic_sum":2,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":6,
      "negative_sum":5,
      "neutral_sum":110
    },
    {
      "dataset":"Telegram",
      "subject":"rec.autos",
      "body_count":119,
      "body_choice":"Brazil truckers blockade Sao Paulo-Rio highway\n\nTruckers in Brazil on Monday partially blocked the main highway between Rio de Janeiro and Sao Paulo, police said, an action that could harm the nation's economy should the protests spread.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":5,
      "negative_sum":6,
      "neutral_sum":108
    },
    {
      "dataset":"Telegram",
      "subject":"rec.motorcycles",
      "body_count":159,
      "body_choice":"London climate change protesters daub Brazilian embassy blood red\n\nClimate change protesters threw red paint onto the Brazilian embassy in London on Tuesday to demonstrate against damage to the Amazon rainforest and what they described as violence against indigenous peoples living there.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":4,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":5,
      "negative_sum":7,
      "neutral_sum":147
    },
    {
      "dataset":"Telegram",
      "subject":"rec.sport.baseball",
      "body_count":158,
      "body_choice":"I honestly dunno how the anime\/nerd\/weeaboo scenario is in Brazil",
      "toxic_sum":2,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":14,
      "negative_sum":7,
      "neutral_sum":137
    },
    {
      "dataset":"Telegram",
      "subject":"rec.sport.hockey",
      "body_count":111,
      "body_choice":"EU piles pressure on Brazil over Amazon fires\n\nThe European Union piled pressure on Friday on Brazilian President Jair Bolsonaro over fires raging in the Amazon basin, with Ireland and France saying they could block a trade deal and Finland urging a ban on Brazilian beef imports.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":3,
      "severe_toxic_sum":0,
      "obscene_sum":3,
      "threat_sum":0,
      "insult_sum":2,
      "identity_hate_sum":0,
      "positive_sum":5,
      "negative_sum":5,
      "neutral_sum":101
    },
    {
      "dataset":"Telegram",
      "subject":"sci.crypt",
      "body_count":116,
      "body_choice":"That's silly, but here in Brazil nobody would expect it",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":4,
      "negative_sum":7,
      "neutral_sum":105
    },
    {
      "dataset":"Telegram",
      "subject":"sci.electronics",
      "body_count":57,
      "body_choice":"Brazilian graft probe puts Swedish firm AF under microscope\n\nThe arrest of a former Brazilian president on corruption charges is raising questions about how a Swedish consulting company won a contract to help build a nuclear power plant at the center of what prosecutors say was a massive bribery and kickback scheme.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":2,
      "negative_sum":4,
      "neutral_sum":51
    },
    {
      "dataset":"Telegram",
      "subject":"sci.med",
      "body_count":161,
      "body_choice":"Which has been blocked in Brazil...",
      "toxic_sum":1,
      "severe_toxic_sum":0,
      "obscene_sum":1,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":7,
      "negative_sum":6,
      "neutral_sum":148
    },
    {
      "dataset":"Telegram",
      "subject":"sci.space",
      "body_count":490,
      "body_choice":"I live in Brazil too, and I thought it was less than that",
      "toxic_sum":3,
      "severe_toxic_sum":0,
      "obscene_sum":2,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":0,
      "positive_sum":21,
      "negative_sum":22,
      "neutral_sum":447
    },
    {
      "dataset":"Telegram",
      "subject":"soc.religion.christian",
      "body_count":71,
      "body_choice":"I don't know if I rage or I laugh about people leaving Brazil to live in Portugal",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":10,
      "negative_sum":4,
      "neutral_sum":57
    },
    {
      "dataset":"Telegram",
      "subject":"talk.politics.guns",
      "body_count":398,
      "body_choice":"Fatal fire exposes poor conditions for young Brazilians\n\nThe deaths of 10 teenagers in a fire at Brazil’s Flamengo soccer club highlighted the precarious conditions many youngsters face as they chase the dream of becoming professional footballers.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":12,
      "negative_sum":14,
      "neutral_sum":372
    },
    {
      "dataset":"Telegram",
      "subject":"talk.politics.mideast",
      "body_count":515,
      "body_choice":"Israel Changes Tack Over Ambassador After Standoff With Brazil<br>\nPlans to name a former settler leader as envoy to the South American nation were dropped after Brasília refused to approve the appointment.<br>\n<br>\nPublished in World<br>\nRead more on The New York Times http:\/\/www.nytimes.com\/2016\/03\/29\/world\/middleeast\/israel-brazil-ambassador.html?partner=IFTTT",
      "toxic_sum":4,
      "severe_toxic_sum":0,
      "obscene_sum":3,
      "threat_sum":0,
      "insult_sum":1,
      "identity_hate_sum":1,
      "positive_sum":24,
      "negative_sum":21,
      "neutral_sum":470
    },
    {
      "dataset":"Telegram",
      "subject":"talk.politics.misc",
      "body_count":1233,
      "body_choice":"Romanian ruling party chief under investigation in Brazil-report\n\nBUCHAREST (Reuters) - The leader of Romania's ruling Social Democrats and speaker of its lower house of parliament, Liviu Dragnea, is under investigation in Brazil on suspicion of money laundering, a Brazilian prosecutor was quoted on Friday as saying.\n\n➖ @ReutersWorld ➖",
      "toxic_sum":8,
      "severe_toxic_sum":0,
      "obscene_sum":5,
      "threat_sum":0,
      "insult_sum":4,
      "identity_hate_sum":1,
      "positive_sum":27,
      "negative_sum":36,
      "neutral_sum":1170
    },
    {
      "dataset":"Telegram",
      "subject":"talk.religion.misc",
      "body_count":51,
      "body_choice":"Armed group kills five in a club in southern Brazil\n\nAn armed group broke into a club in the southern Brazilian city of Mostardas before dawn on Saturday and shot at employees and customers, killing five people and leaving four others severely injured, according to local media reports.\n\n➖ @ReutersWorldChannel ➖",
      "toxic_sum":0,
      "severe_toxic_sum":0,
      "obscene_sum":0,
      "threat_sum":0,
      "insult_sum":0,
      "identity_hate_sum":0,
      "positive_sum":3,
      "negative_sum":4,
      "neutral_sum":44
    }
  ]
}